Revit 2026 API

# NoiseTextureRealWorldOffsetY Property

---

The property labeled "Offset Y" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureRealWorldOffsetY { get; }
```
```vb
Public Shared ReadOnly Property TextureRealWorldOffsetY As String
	Get
```
```cpp
public:
static property String^ TextureRealWorldOffsetY {
	String^ get ();
}
```
```fsharp
static member TextureRealWorldOffsetY : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace